Autodesk.Revit.DB.Lighting.BasicLossFactor.LossFactor
The loss factor.
The loss factor as a numerical value between 0.0 and 4.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The loss factor is not valid because it is not between 0.0 and 4.0.
Since:
2013

Autodesk.Revit.DB.Lighting.BasicLossFactor.#ctor(Autodesk.Revit.DB.Lighting.BasicLossFactor)
Creates a copy of the given basic loss factor object
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.BasicLossFactor.#ctor(System.Double)
Creates a basic loss factor object with the given value.
lossFactorIn:
The loss factor as a numerical value between 0.0 and 4.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The loss factor is not valid because it is not between 0.0 and 4.0.
Since:
2013

Autodesk.Revit.DB.Lighting.BasicLossFactor.#ctor
Creates a basic loss factor object with no loss.
Since:
2013

Autodesk.Revit.DB.Lighting.BasicLossFactor
This class encapsulates basic lighting loss factor calculation.
Since:
2013